module SiteMap

  def self.online_cafe
    site_map = {
      ["Суп курячий", "Суп-пюре грибний", "Суп з лососем"] => 
        "http://online-cafe.ck.ua/site/shop/pershi-stravi/",
      ["Салат «Грецький»", "Салат «Цезар»", "Салат «Європа»", "Салат «Мисливський»", "Салат «Фірмовий»", 
        "Салат «Фруктовий»", "Нарізка Овочева", "Нарізка М`ясна", "Нарізка Фруктова"] => 
        "http://online-cafe.ck.ua/site/product-category/salati/",
      ["Свинний стейк з картоплею фрі", "Свинний стейк з овочевим гарніром", "Курячий стейк з картоплею фрі",
       "Курячий стейк з овочевим гарніром", "Картоха фрі з соусом", "Картоха фрі з яєчнею та грінками",
       "Картоха фрі з мисливськими ковбасками", "Картоха фрі «Дружба»", "Деруни", "Омлет", "Пельмені",
       "Курячі нагетси", "Грибочки гриль", "Сирні крокети", "Клешні краба", "Гриль-лаваш 1", "Гриль-лаваш 2",
       "Гриль-лаваш 3", "Гриль-лаваш 4"] =>
        "http://online-cafe.ck.ua/site/product-category/garyachi-stravi/",
      ["Піца Чорноморська(чорна)", "Піца Грецька(чорна)", "Піца Селянська(чорна)",
       "Піца Маргарита", "Піца Гавайська", "Піца Мисливська", "Піца Морська", "Піца М`ясна", "Піца Європейська",
       "Кальцоне Морський", "Кальцоне Італійський", "Кальцоне М’ясний", "Кальцоне Грибний", "Кальцоне Фірмовий",
       "Кальцоне Курячий", "Кальцоне від Шефа"] =>
        "http://online-cafe.ck.ua/site/product-category/pitsa/",
      ["Млинець без начинки", "Млинець 1", "Млинець 2", "Млинець 3", "Млинець 4", "Млинець 5", "Млинець 6",
       "Млинець 7", "Млинець 8", "Млинець 9", "Млинець 10", "Млинець 11", "Млинець 12", "Млинець 13", "Млинець 14",
       "Млинець 15", "Млинець 16", "Млинець 17", "Млинець 18", "Млинець 19", "Млинець 20"] =>
        "http://online-cafe.ck.ua/site/product-category/mlintsi/",
      ["Гірчиця", "Майонез", "Кетчуп", "Мед", "Сметана", "Сирний соус", "Часниковий соус", "Грибний соус",
       "Томатний соус"] =>
        "http://online-cafe.ck.ua/site/product-category/sous/",
      ["Чай чорний байховий вищого сорту", "Чай чорний байховий з ароматом бергамоту", 
       "Чай зелений байховий вищого сорту", "Чай зелений байховий з ароматом жасміну",
       "Чай ройбуш з ароматом полуниці та вершків", "Чай з женьшенем", "Чай з лісовими ягодами",
       "Чай «Персидське яблуко» з ароматом цитрусових"] =>
        "http://online-cafe.ck.ua/site/product-category/chajna-karta/",
      ["Еспрессо", "Американо", "Капучино", "Мокко", "Лате", "Глясе"] =>
        "http://online-cafe.ck.ua/site/product-category/kavova-karta/",
      ["Сироп Гренадін", "Сироп Ваніль", "Сироп Кокос", "Сироп Вишня", "Сироп Шоколад"] =>
        "http://online-cafe.ck.ua/site/product-category/sirop/",
      ["Пиво Роберт Домс розливне 0,3 л", "Пиво Роберт Домс розливне 0,5 л", "Львівське 1715 розливне 0.3 л",
       "Львівське 1715 розливне 0.5 л", "Балтика №7 розливне 0.3 л", "Балтика №7 розливне 0.5 л",
       "Львівське Білий Лев розливне 0.3 л", "Львівське Білий Лев розливне 0.5 л", "Жигулівське Мінське",
       "Пиво Роберт Домс в пляшці", "Славутич Ice Mix в асортименті", "Львівське Білий Лев в пляшці", 
       "Львівське 1715 в пляшці", "Жатецький гусь в пляшці", "Tuborg в пляшці", "Carlsberg в пляшці"] => 
        "http://online-cafe.ck.ua/site/product-category/pivo/",
      ["Курячі нагетси", "Грибочки гриль", "Сирні крокети", "Клешні краба", "Сир «Косичка»",
          "Тарілка до пива", "Арахіс солоний 100 г"] =>
        "http://online-cafe.ck.ua/site/product-category/do-piva/",
      ["Морозиво в асортименті", "Топінги до морозива", "Морозиво з фруктами", "Млинець з морозивом",
       "Фруктовий салат", "Тортуффо", "Бите скло", "Желе з фруктами", "Пташине молоко"] =>
        "http://online-cafe.ck.ua/site/product-category/deserti/",
      ["Бонаква 1 л", "Кока-кола 1 л", "Бонаква 0.5 л", "Фанта 0.5 л", "Кока-кола 0.5 л", "Спрайт 0.5 л",
       "Молочний коктейль", "Дитяче шампанське", "Какао", "Соки Rich"] =>
       "http://online-cafe.ck.ua/site/product-category/napoyi/"}
  end

  def self.bambolina
    site_map = {
      ["Пицца №1", "Пицца №2", "Пицца №3"] => 
        "http://bambolina.ck.ua/menu-pizzerii/pizza",
      ["Салат Весенний", "Салат Итальянский", "Салат Греческий"] => 
        "http://bambolina.ck.ua/menu-pizzerii/salaty"}
  end
  
end